CSI API ETABS v1
cDatabaseTables.SetTableForEditingCSVString Method
 Reads a table from a CSV-formatted string and adds it to a stored table list until either the ApplyEditedTables(Boolean, Int32, Int32, Int32, Int32, String) or CancelTableEditing() command is issued.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTableForEditingCSVString(
	string TableKey,
	ref int TableVersion,
	ref string csvString,
	string sepChar = ","
)
Function SetTableForEditingCSVString (
	TableKey As String,
	ByRef TableVersion As Integer,
	ByRef csvString As String,
	Optional sepChar As String = ","
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim TableVersion As Integer
Dim csvString As String
Dim sepChar As String
Dim returnValue As Integer
returnValue = instance.SetTableForEditingCSVString(TableKey,
	TableVersion, csvString, sepChar)
int SetTableForEditingCSVString(
	String^ TableKey,
	int% TableVersion,
	String^% csvString,
	String^ sepChar = L","
)
abstract SetTableForEditingCSVString :
        TableKey : string *
        TableVersion : int byref *
        csvString : string byref *
        ?sepChar : string
(* Defaults:
        let _sepChar = defaultArg sepChar ","
*)
-> int
Parameters
TableKey
Type: System.String
Input Item: The table key for a table which has been interactively edited. The table must be one that can be interactively edited.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
csvString
Type: System.String
Input Item: A CSV-formatted string containing all the table data. Newline characters should be used to demarcate rows.
sepChar (Optional)
Type: System.String
Optional Input Item: The delimiter between data items in the same row, by default "," . This delimiter must match what is used in the csvString.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace